## "Диагонали символами"

### Задание

Даны сторона квадрата. Вывести его диагонали символами #

### Формат входных данных

Дано целое число n, длина стороны квадрата. 1 < n < 20 

### Формат выходных данных

Вывести диагонали квадрата символами # (см. примеры)

#### Примеры

n = 6 
```
#    #
 #  #
  ##
  ##
 #  #
#    #
```
n = 3
```
# #
 #
# #
```
### Решение задачи

```python
n = int(input("Количество: "))

pos = 0

if n % 2 == 0:
    while pos < n // 2:
        print(" " * pos, "#", " " * (n - pos * 2 - 2), "#", sep=" ")
        pos += 1
    while pos > 0:
        print(" " * (pos - 1), "#", " " * (n - (pos - 1) * 2 - 2), "#", sep=" ")
        pos -= 1
else:
    while pos < n // 2:
        print(" " * pos, "#", " " * (n - pos * 2 - 2), "#", sep=" ")
        pos += 1
    print(" " * pos, "#", sep=" ")
    while pos - 1 >= 0:
        print(" " * (pos - 1), "#", " " * (n - (pos - 1) * 2 - 2), "#", sep=" ")
        pos -= 1

```
