## "Дружественные числа"

### Задание

Два натуральных числа называются дружественными, если каждое из них равно сумме всех натуральных делителей другого
(само число при этом не рассматривается в качестве собственного делителя). \
Необходимо найти все пары натуральных дружественных чисел (не равных друг другу), до введенного числа.

### Формат входных данных

Дано одно целое положительное число

### Формат выходных данных

Вывести все пары дружественных чисел, удовлетворяющие условию задачи.

### Решение задачи

```python
cond = int(input("Число: "))

right = cond
temp = cond - 1
left = 0
buffer = 0
while right > 0:
    while temp > 0:
        if right % temp == 0:
            left += temp
            # print(left)
        temp -= 1
    temp = left - 1

    while temp > 0:
        if left % temp == 0:
            buffer += temp
        temp -= 1
    if right == buffer and left < right:
        print(left, right)
    right -= 1
    temp = right - 1
    left = 0
    buffer = 0
```

---

### Данные для самопроверки

| Дано | Результат |
| :---: | --- |
|  300  | 220 284 |
